[
  {
    "exam_name": "Using Linux Terminal",
    "exam_description": "Prove your basic operational knowledge of Linux Terminal by demonstrating your ability to secure, operate and managing basic system resources. Topics include user and group management, file and filesystem navigation, and identifying logs and installation tasks related to system maintenance.",
    "syllabus": [
      {
        "chapter_title": "Navigating Files and Filesystems",
        "chapter_sections": [
          "Navigate and manipulate directories and files using terminal commands",
          "Search, compare and modify files in the terminal using regular expressions, pipe operators and redirection"
        ]
      },
      {
        "chapter_title": "Managing System Resources",
        "chapter_sections": [
          "Locate system logs and configure log rotation",
          "Reconstruct disk partitions and filesystems using tools such as fdisk, fsck and parted",
          "Identify correct crontab format and location",
          "Interpret system logs during troubleshooting"
        ]
      },
      {
        "chapter_title": "Securing Filesystem Access",
        "chapter_sections": [
          "Create and manage SSH keys",
          "Configure system-wide and user-specific security settings",
          "Configure password complexity and expiry rules",
          "Interpret sudo configuration policies and their security implications",
          "Manage user and group accounts, access and membership",
          "Manage directory and file ownership and access"
        ]
      }
    ]
  },
  {
    "exam_name": "Using Ubuntu Desktop",
    "exam_description": "Demonstrate your knowledge of Ubuntu Desktop administrative essentials. Focus on package and application management, system installation, basic network configuration, working in the open source community, and interfacing with external security policies.",
    "syllabus": [
      {
        "chapter_title": "Configuring Networking Capabilities",
        "chapter_sections": [
          "Configure a network connection",
          "Characterize and differentiate layer 2 networking principles such as MAC addresses, ARP resolution, and broadcast/multicast behavior"
        ]
      },
      {
        "chapter_title": "Engaging with the Open Source Community",
        "chapter_sections": [
          "Recognize LTS concepts such as release cycle and versioning conventions",
          "Familiarization with the Ubuntu community and its governance",
          "Interpret common open-source licenses to determine usage rights, modification permissions, and distribution requirements [NOTE: This item is currently on Using Linux Terminal but is moving to the Using Desktop exam in the 2026 edition.]"
        ]
      },
      {
        "chapter_title": "Installing Ubuntu Desktop",
        "chapter_sections": [
          "Fix boot issues involving components such as GRUB2 and Initramfs",
          "Upgrade Ubuntu LTS releases",
          "Create a bootable USB drive for Ubuntu",
          "Install proprietary drivers for GPU and Wi-Fi devices",
          "Create and manage LVM volumes, filesystems and snapshots"

        ]
      },
      {
        "chapter_title": "Managing Applications",
        "chapter_sections": [
          "List and upgrade installed packages",
          "Distinguish and transition between deb and snap applications",
          "Contrast deb packages vs snaps",
          "Install packages from multiple sources",
          "Find and interpret package descriptions",
          "Manage package updates using utilities such as apt-get, unattended upgrades, Synaptic and Aptitude"
        ]
      },
      {
        "chapter_title": "Securing Desktop Systems",
        "chapter_sections": [
          "Describe and contrast PKI components, their roles and use-cases involving Desktop systems",
          "Connect to an Active Directory realm",
          "Assign permissions to directories using ACL attributes"
        ]
      },
      {
        "chapter_title": "Configure Networking Capabilities",
        "chapter_sections": [
          "Configure a Wifi Network Connection",
          "Interact with basic L2 and L3 network configuration"
        ]
      }
    ]
  },
  {
    "exam_name": "Using Ubuntu Server",
    "exam_description": "Illustrate your knowledge of common Ubuntu Server administrative tasks and troubleshooting. Topics include job control, services setup and management, server security, and basic server deployment.",
    "syllabus": [
      {
        "chapter_title":"Configuring Servers and Services",
        "chapter_sections": [
          "Control server services via systemd",
          "Configure automated remote backups and restore using systemd timers or cron",
          "Setup a fileserver using NFS or Samba protocols",
          "Setup a basic web application using Apache or Nginx with a database such as MySQL, PostgreSQL or MongoDB"
        ]
      },
      {
        "chapter_title": "Deploying Ubuntu Server",
        "chapter_sections":[
          "Install Ubuntu Server using various deployment technologies such as PXE boot, autoinstall and cloud-init",
          "Validate that a system is capable of meeting use case needs based on a list of deployment requirements",
          "Boot into single user mode"
        ]
      },
      {
        "chapter_title": "Securing Server Access",
        "chapter_sections": [
          "Configure remote SSH access",
          "Contrast employment of regular and system users",
          "Install and configure a firewall using iptables or ufw"
        ]
      },
      {
        "chapter_title": "Managing Processes",
        "chapter_sections":[
          "Identify and manage system processes and services",
          "Identify and list running, disabled, and inactive systemd units"
        ]
      }
    ]
  }
]
